[
    {
        "name": "Farnsworth House",
        "type": "residential",
        "style": "modernist",
        "year_built": 1951,
        "architect": "Ludwig Mies van der Rohe",
        "firm": null,
        "street": "14520 River Road",
        "city": "Plano",
        "state": "Illinois",
        "country": "USA",
        "img_path": "/static/img/structures/Farnsworth House.jpg",
        "img_path2": "/static/img/structures/Farnsworth House 2.jpg",
        "lat": 41.635749274166784,
        "lng": -88.5356838,
        "header": "A Symphony of Design and Nature",
        "summary": "Experience the timeless elegance of Farnsworth House – a masterpiece by visionary architect Ludwig Mies van der Rohe. Nestled along the Fox River in Plano, Illinois, this iconic gem seamlessly blurs the line between nature and architecture. Commissioned in the 1950s as an enchanting escape, the house's glass and steel design invites natural light to play within, creating an ever-changing canvas of reflections and shadows. A haven of minimalist elegance, Farnsworth House is a radiant beacon of architectural brilliance, captivating hearts for generations to come."
    },
    {
        "name": "Banff Springs Hotel",
        "type": "hospitality",
        "style": "châteauesque",
        "year_built": 1888,
        "architect": "Bruce Price",
        "firm": null,
        "street": "405 Spray Avenue",
        "city": "Banff",
        "state": "Alberta",
        "country": "Canada",
        "img_path": "/static/img/structures/Banff Springs Hotel.jpg",
        "img_path2": "/static/img/structures/Banff Springs Hotel 2.jpg",
        "lat": 51.16448671394784,
        "lng": -115.56185146075049,
        "header": "A Jewel in the Rockies",
        "summary": "Nestled in Alberta's majestic Canadian Rockies, the Banff Springs Hotel is a testament to timeless elegance and historical significance. Built in the late 19th century, its Scottish Baronial architecture stands as a grand homage to the romantic castles of Europe, set against the raw beauty of Banff National Park. This iconic hotel not only offers luxurious accommodation but also serves as a gateway to the natural splendor of the Rockies, with activities like hiking and skiing at its doorstep. The Banff Springs is more than a hotel; it's a historical landmark, intricately woven into the tapestry of Canadian heritage, offering a unique blend of opulent history and breathtaking natural scenery."
    },
    {
        "name": "Haus der Kulturen der Welt",
        "type": "cultural",
        "style": "modernist",
        "year_built": 1957,
        "architect": "Hugh Stubbins",
        "firm": null,
        "street": "John-Foster-Dulles-Allee 10",
        "city": "Berlin",
        "state": null,
        "country": "Germany",
        "img_path": "/static/img/structures/Haus der Kulturen der Welt.jpg",
        "img_path2": "/static/img/structures/Haus der Kulturen der Welt 2.jpg",
        "lat": 52.51866862845876,
        "lng": 13.364464897007947,
        "header": "A Modern Marvel in the Heart of Berlin",
        "summary": "In the vibrant cityscape of Berlin, the Haus der Kulturen der Welt (House of World Cultures) stands as a symbol of contemporary architectural innovation and cultural diversity. This remarkable building, originally a gift from the United States to Germany, was constructed in the 1950s and is renowned for its distinctive modernist design, featuring a sweeping, curved roof that has earned it the nickname \"the pregnant oyster.\" As a center for international contemporary arts, it hosts a variety of exhibitions, performances, and events that showcase the rich tapestry of global cultures. The Haus der Kulturen der Welt not only represents architectural ingenuity but also acts as a vibrant hub for cross-cultural dialogue and exchange, reflecting Berlin’s status as a cosmopolitan and forward-thinking city."
    },
    {
        "name": "Ponte City",
        "type": "residential",
        "style": "brutalist",
        "year_built": 1975,
        "architect": "Manfred Hermer",
        "firm": null,
        "street": "1 Lily Avenue",
        "city": "Johannesburg",
        "state": null,
        "country": "South Africa",
        "img_path": "/static/img/structures/Ponte City.jpg",
        "img_path2": "/static/img/structures/Ponte City 2.jpg",
        "lat": -26.19031794851164,
        "lng": 28.0570492670872,
        "header": "Johannesburg's Architectural Beacon",
        "summary": "Ponte City Apartments, a towering cylindrical skyscraper in the heart of Johannesburg, South Africa, stands as an iconic landmark reflecting the city's complex history and urban evolution. Built in 1975, this 54-story building is the tallest residential skyscraper in Africa, distinguished by its hollow cylindrical shape and a striking neon sign atop. Originally a symbol of modern luxury, Ponte City has witnessed the socio-economic shifts within Johannesburg, mirroring the city's own transformations. Today, it serves not only as a residential space but also as a beacon of urban regeneration and community resilience. The building's unique architecture and compelling history make it a fascinating subject of study for architects and historians, encapsulating a significant era of Johannesburg's urban development."
    },
    {
        "name": "Bruno House",
        "type": "residential",
        "style": "bauhaus",
        "year_built": 1933,
        "architect": "Wilhelm Ze'ev Haller",
        "firm": null,
        "street": "Strauss Street 3",
        "city": "Tel Aviv",
        "state": null,
        "country": "Israel",
        "img_path": "/static/img/structures/Bruno House.webp",
        "img_path2": "/static/img/structures/Bruno House 2.jpg",
        "lat": 32.06752007659799,
        "lng": 34.77271931755659,
        "header": "A Bauhaus Gem in the White City",
        "summary": "Bruno House in Tel Aviv, Israel, stands as a testament to the harmonious blend of functionalism and Bauhaus aesthetics. Designed in the early 20th century, this structure is part of the White City, recognized by UNESCO for its collection of International Style architecture. Characterized by clean lines, an unadorned facade, and a focus on utility, Bruno House embodies the ideals of the modernist movement. Its significance lies not only in its architectural merit but also in its representation of Tel Aviv's urban and cultural history, showcasing the city's development and its embrace of modernist architectural principles. Bruno House remains a poignant example of architectural innovation, seamlessly integrated into the urban fabric of Tel Aviv."
    },
    {
        "name": "Four Seasons Centre for the Performing Arts",
        "type": "cultural",
        "style": "modernist",
        "year_built": 2006,
        "architect": null,
        "firm": "Diamond Schmitt Architects Inc.",
        "street": "145 Queen Street W",
        "city": "Toronto",
        "state": "Ontario",
        "country": "Canada",
        "img_path": "/static/img/structures/Four Seasons Centre for the Performing Arts.jpg",
        "img_path2": "/static/img/structures/Four Seasons Centre for the Performing Arts 2.jpg",
        "lat": 43.65075151955088,
        "lng": -79.38569373235418,
        "header": "Harmony in Glass and Stone",
        "summary": "The Four Seasons Centre for the Performing Arts in Toronto is a contemporary architectural marvel and a premier venue for the arts. Opened in 2006, this state-of-the-art facility is celebrated for its outstanding acoustics and elegant, modern design. Home to the Canadian Opera Company and the National Ballet of Canada, the centre provides a world-class stage for performances, drawing in audiences with its sophisticated yet inviting atmosphere. Its transparent, glass-walled façade symbolizes openness and accessibility, inviting passersby to engage with the arts. The Four Seasons Centre is not just a building but a vibrant hub of cultural expression, playing a pivotal role in Toronto's artistic landscape."
    },
    {
        "name": "Sydney Opera House",
        "type": "cultural",
        "style": "expressionist",
        "year_built": 1973,
        "architect": "Jørn Utzon",
        "firm": null,
        "street": "Bennelong Point",
        "city": "Sydney",
        "state": null,
        "country": "Australia",
        "img_path": "/static/img/structures/Sydney Opera House.jpg",
        "img_path2": "/static/img/structures/Sydney Opera House 2.jpg",
        "lat": -33.85657945272001,
        "lng": 151.21528596743514,
        "header": "Sails on the Harbour",
        "summary": "The Sydney Opera House, with its iconic silhouette resembling sails on the water, stands as an architectural masterpiece on the shores of Sydney Harbour. Designed by Jørn Utzon and opened in 1973, this UNESCO World Heritage Site is celebrated for its innovative design and engineering marvel. The building's distinctive roof, composed of interlocking shell-like panels, creates a visually stunning effect, mirroring the fluidity of the sea and sky. As a premier venue for the performing arts, it hosts a myriad of events, from opera to theatre, embodying the cultural heartbeat of Sydney. The Opera House is not just an architectural wonder but a symbol of Australia's creative and adventurous spirit."
    },
    {
        "name": "Habitat 67",
        "type": "residential",
        "style": "brutalist",
        "year_built": 1967,
        "architect": "Moshe Safdie",
        "firm": null,
        "street": "2600 Avenue Pierre-Dupuy",
        "city": "Montreal",
        "state": "Quebec",
        "country": "Canada",
        "img_path": "/static/img/structures/Habitat 67.jpg",
        "img_path2": "/static/img/structures/Habitat 67 2.jpg",
        "lat": 45.49999701002117,
        "lng": -73.54373416108785,
        "header": "Architectural Innovation Unleashed",
        "summary": "Habitat 67, nestled in the vibrant city of Montreal, is an iconic example of experimental architectural design. Conceived by architect Moshe Safdie for Expo 67, this unique residential complex revolutionized the concept of urban living with its interlocking concrete forms and terraced design. Its futuristic, modular structure challenged conventional apartment living, offering private gardens and stunning views in a dense urban setting. Habitat 67 not only remains a significant architectural landmark but also continues to inspire with its visionary approach to harmonizing community living with individual space in the urban landscape."
    },
    {
        "name": "Jepson Center for the Arts",
        "type": "cultural",
        "style": "modernist",
        "year_built": 2006,
        "architect": "Moshe Safdie",
        "firm": null,
        "street": "207 W York Street",
        "city": "Savannah",
        "state": "Georgia",
        "country": "USA",
        "img_path": "/static/img/structures/Jepson Center for the Arts.jpg",
        "img_path2": "/static/img/structures/Jepson Center for the Arts 2.jpg",
        "lat": 32.078494561950414,
        "lng": -81.09516293290798,
        "header": "Modernist Marvel in Historic Savannah",
        "summary": "The Jepson Center for the Arts in Savannah, Georgia, is a striking example of contemporary architecture in a city renowned for its historic charm. Designed by architect Moshe Safdie, this modern art museum opened in 2006 and stands out with its sleek, geometric lines and extensive use of glass. The center is dedicated to contemporary art and education, offering dynamic exhibition spaces, interactive children’s galleries, and a state-of-the-art auditorium. Its design complements Savannah’s historic district while adding a distinct modernist touch, bridging the gap between past and present. The Jepson Center not only enriches Savannah’s cultural landscape but also serves as a beacon of modern art and architectural innovation."
    },
    {
        "name": "Tân Định Church",
        "type": "religious",
        "style": "neo-gothic",
        "year_built": 1876,
        "architect": "unknown",
        "firm": null,
        "street": "289 Hai Bà Trưng Street",
        "city": "Ho Chi Minh City",
        "state": null,
        "country": "Vietnam",
        "img_path": "/static/img/structures/Tan Dinh Church.jpg",
        "img_path2": "/static/img/structures/Tan Dinh Church 2.jpg",
        "lat": 10.788737663514922,
        "lng": 106.69076043948571,
        "header": "The Rose-Hued Marvel",
        "summary": "Tan Dinh Church, with its striking pink façade, is a unique architectural landmark in Ho Chi Minh City, Vietnam. Known for its vibrant color and Gothic-Romanesque style, the church was built in the late 19th century during the French colonial period. Its design features intricate patterns, towering spires, and detailed stained glass windows, creating a captivating blend of European and Vietnamese cultural influences. This vividly hued church not only serves as a place of worship but also stands as a symbol of the city's rich, multifaceted history, attracting both locals and tourists alike. Tan Dinh Church's distinctive appearance and historical significance make it a cherished icon in Ho Chi Minh City's urban tapestry."
    },
    {
        "name": "Deichman Library",
        "type": "institutional",
        "style": "modernist",
        "year_built": 2020,
        "architect": null,
        "firm": "Lundhagem",
        "street": "2 C. Sundts Street",
        "city": "Oslo",
        "state": null,
        "country": "Norway",
        "img_path": "/static/img/structures/Deichman Library.jpg",
        "img_path2": "/static/img/structures/Deichman Library 2.jpg",
        "lat": 59.908871796481556,
        "lng": 10.752581139830076,
        "header": "A Nexus of Knowledge and Design",
        "summary": "Deichman Library, Oslo's architectural jewel, marries cutting-edge design with the pursuit of knowledge. Opened in 2020, this modern library dazzles with its geometric glass structure, creating an inviting space of light and transparency. As the largest library in Oslo, it stands as a cultural and educational epicenter, offering extensive collections and state-of-the-art digital amenities. The library's design fosters a sense of community and accessibility, symbolizing the modern library's role as a center for learning, creativity, and social interaction in the digital age. Deichman Library is more than a repository of books; it's a vibrant, interactive space that anchors Oslo's intellectual and cultural life."
    },
    {
        "name": "Inntel Hotel",
        "type": "hospitality",
        "style": "postmodernist",
        "year_built": 2010,
        "architect": null,
        "firm": "WAM Architecten",
        "street": "Provincialeweg 102",
        "city": "Zaandam",
        "state": null,
        "country": "the Netherlands",
        "img_path": "/static/img/structures/Inntel Hotel.jpg",
        "img_path2": "/static/img/structures/Inntel Hotel 2.jpg",
        "lat": 52.438686702480936,
        "lng": 4.8159301,
        "header": "A Whimsical Architectural Collage",
        "summary": "The Inntel Hotel in Zaandam, Netherlands, is a playful and imaginative take on traditional Dutch architecture. Known for its striking façade, which resembles a stack of various traditional Dutch houses in a range of colors and styles, the hotel is a visual spectacle. Opened in 2009, this unique design pays homage to the rich history and architectural heritage of the Zaan region, while providing a modern, luxurious stay for its guests. The Inntel Hotel Zaandam is not just a place to rest; it's a standout example of contemporary architecture's ability to merge whimsy with functionality, creating a memorable landmark in the heart of Zaandam."
    }
]